app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My edit"], ["description", "My post description"], ["updated_at", "2015-12-31 20:39:10.987245"], ["id", 1]]
---
	def update
	  @post = Post.find(params[:id])
	  # @post.update(title: params[:title], description: params[:description])
		#change this code to require post for access to all of the params
		@post.update(params.require(:post).permit(:title, :description))